       IDENTIFICATION DIVISION.

       PROGRAM-ID. PRUESPERE.
       DATE-WRITTEN. 31-05-1995.
       SECURITY. MENSAJE DE ESPERAR EN PANTALLA.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  PROG       PIC X(10) VALUE "PRUESPERE".
       77  TECLA      PIC X.
       LINKAGE SECTION.
       01  LITERALAVISO.
           03 LITERALAVISO1 PIC X(40).
           03 LITERALAVISO2 PIC X(40).
       PROCEDURE DIVISION USING LITERALAVISO.
       TRABAJO SECTION.
       TRAB.
           DISPLAY "DEBUG:" LITERALAVISO UPON SYSOUT
           GO TO FIN-PROGRAMA.
       FIN-PROGRAMA.
           EXIT PROGRAM.
       FIN-DEL-TO.
           STOP RUN.

